_org/posts/2015-09-06-printer-cartridges-wow.org
#+BEGIN_HTML
---
layout: post
tags:
- moan
---
#+END_HTML

* Champaigne or printer ink?

Who knew printer ink [[http://blogs.which.co.uk/technology/news/printer-ink-is-more-expensive-than-champagne/][was more expensive than champagne?]] Unbelievable, particularly considering that [[http://www.theguardian.com/money/2013/feb/23/printer-ink-cartridges-paying-more-getting-less][cartridges are shipping with less and less ink.]]

* Alternatives

There are alternatives but from a quick google they are incredibly risky and can do anything from produce poor quality prints to ruining the printer heads. There are 'refurbished' cartridges but even they don't have a great reputation.

The first set of replacement cartridges I purchased were refurbished and the printer just flat out refused to accept them.

* Pony up

So, time to pony up the 50 pounds to replace 4 cartridges of ink. [[http://www.amazon.co.uk/HP-950XL-951XL-Cartridge-C2P43AE/dp/B00D145OYY/ref%3Dsr_1_fkmr1_1?ie%3DUTF8&qid%3D1441540674&sr%3D8-1-fkmr1&keywords%3Dho%2Bofficejet%2B8600%2Bink][Amazon]] seem to be the cheapest, still, 50 pounds. Unbelievable.
