_posts/2015-09-06-printer-cartridges-wow.html
---
layout: post
tags:
- moan
---

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Champaigne or printer ink?</h2>
<div class="outline-text-2" id="text-1">
<p>
Who knew printer ink <a href="http://blogs.which.co.uk/technology/news/printer-ink-is-more-expensive-than-champagne/">was more expensive than champagne?</a> Unbelievable, particularly considering that <a href="http://www.theguardian.com/money/2013/feb/23/printer-ink-cartridges-paying-more-getting-less">cartridges are shipping with less and less ink.</a>
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Alternatives</h2>
<div class="outline-text-2" id="text-2">
<p>
There are alternatives but from a quick google they are incredibly risky and can do anything from produce poor quality prints to ruining the printer heads. There are 'refurbished' cartridges but even they don't have a great reputation.
</p>

<p>
The first set of replacement cartridges I purchased were refurbished and the printer just flat out refused to accept them.
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Pony up</h2>
<div class="outline-text-2" id="text-3">
<p>
So, time to pony up the 50 pounds to replace 4 cartridges of ink. <a href="http://www.amazon.co.uk/HP-950XL-951XL-Cartridge-C2P43AE/dp/B00D145OYY/ref=sr_1_fkmr1_1?ie=UTF8&qid=1441540674&sr=8-1-fkmr1&keywords=ho+officejet+8600+ink">Amazon</a> seem to be the cheapest, still, 50 pounds. Unbelievable.
</p>
</div>
</div>
